Catalogs/ЛБ_Акции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ЛБ_Акции</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидАкции</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыАкций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Промокод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДниНедели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДеньНедели</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СтатусыЗаемщика</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ЛБ_ЛьготныеСтатусыЗаемщика</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ЛБ_ВидыАкций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ВидыАкций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоДням</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоПромокоду</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоСтатусамЗаемщика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаПредъявителя</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ЛБ_Акции/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СписокДнейНедели.Добавить(1, "Понедельник"); 
	СписокДнейНедели.Добавить(2, "Вторник");
	СписокДнейНедели.Добавить(3, "Среда");
	СписокДнейНедели.Добавить(4, "Четверг");
	СписокДнейНедели.Добавить(5, "Пятница");
	СписокДнейНедели.Добавить(6, "Суббота");
	СписокДнейНедели.Добавить(7, "Воскресенье");  
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда   
		Для каждого Эл Из СписокДнейНедели Цикл
			Отбор = Новый Структура;
			Отбор.Вставить("ДеньНедели", Эл.Значение);
			Если НЕ Объект.ДниНедели.НайтиСтроки(Отбор).Количество() = 0 Тогда
				Эл.Пометка = Истина;
			КонецЕсли;	
		КонецЦикла;	 
	КонецЕсли;
	Если Объект.ВидАкции = Перечисления.ЛБ_ВидыАкций.ПоДням Тогда
		Элементы.ГруппаДень.Видимость = Истина;
	ИначеЕсли Объект.ВидАкции = Перечисления.ЛБ_ВидыАкций.ПоПромокоду Тогда
		Элементы.ГруппаПромокод.Видимость = Истина;
	ИначеЕсли Объект.ВидАкции = Перечисления.ЛБ_ВидыАкций.ПоСтатусамЗаемщика Тогда
		Элементы.ГруппаСтатусы.Видимость = Истина;
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВидАкцииПриИзменении(Элемент)  
	Если Объект.ВидАкции = ПредОпределенноеЗначение("Перечисление.ЛБ_ВидыАкций.ПоДням") Тогда
		Элементы.ГруппаДень.Видимость = Истина;  
		Элементы.ГруппаПромокод.Видимость = Ложь;  
		Элементы.ГруппаСтатусы.Видимость = Ложь; 
	ИначеЕсли Объект.ВидАкции = ПредОпределенноеЗначение("Перечисление.ЛБ_ВидыАкций.ПоПромокоду") Тогда
		Элементы.ГруппаПромокод.Видимость = Истина; 
		Элементы.ГруппаДень.Видимость = ложь;
		Элементы.ГруппаСтатусы.Видимость = Ложь;
	ИначеЕсли Объект.ВидАкции = ПредОпределенноеЗначение("Перечисление.ЛБ_ВидыАкций.ПоСтатусамЗаемщика") Тогда
		Элементы.ГруппаСтатусы.Видимость = Истина; 
		Элементы.ГруппаПромокод.Видимость = Ложь; 
		Элементы.ГруппаДень.Видимость = ложь;
	Иначе
		Элементы.ГруппаСтатусы.Видимость = Ложь; 
		Элементы.ГруппаПромокод.Видимость = Ложь; 
		Элементы.ГруппаДень.Видимость = ложь;
    КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ТекущийОбъект.ВидАкции = Перечисления.ЛБ_ВидыАкций.ПоДням Тогда
		ТекущийОбъект.ДниНедели.Очистить();
		Для каждого Эл Из СписокДнейНедели Цикл
			Если Эл.Пометка Тогда
				СтрДни = ТекущийОбъект.ДниНедели.Добавить();
				СтрДни.ДеньНедели = Эл.Значение;
			КонецЕсли;
		КонецЦикла;

		Если ТекущийОбъект.ДниНедели.Количество() = 0 Тогда
			Сообщить("Выберите дни недели когда действует акция!");
			Отказ = Истина;  
		КонецЕсли;	
	ИначеЕсли ТекущийОбъект.ВидАкции = Перечисления.ЛБ_ВидыАкций.ПоПромокоду И ПустаяСтрока(ТекущийОбъект.Промокод) Тогда
		Сообщить("Введите промокод!");
		Отказ = Истина;
	ИначеЕсли ТекущийОбъект.ВидАкции = Перечисления.ЛБ_ВидыАкций.ПоСтатусамЗаемщика И ТекущийОбъект.СтатусыЗаемщика.Количество() = 0 Тогда
		Сообщить("Выберите льготные статусы клиентов для которых действует акция!");
		Отказ = Истина
	КонецЕсли;    
	
КонецПроцедуры
